[
  {
    "name": "Uplevel",
    "id": "uplevel",
    "url": "http://www.uplevelteam.com",
    "location": "Seattle, WA",
    "mapsLink": null,
    "title": "Principal engineer",
    "start": "2019-03-01",
    "end": "2025-01-23",
    "summary": "Uplevel, a series-A startup hatched at Madrona Venture Labs, hired me as front-end SME for its main product offering (an engineering effectiveness dashboard) as it worked to achieve product/market fit.",
    "contributions": [
      {
        "item": "Led front-end development of two different React SPA webapps (create-react-app and vite) delivering effectiveness dashboards for software engineering organizations, including Fortune 100 companies."
      },
      {
        "item": "Owned front-end repository as SME, maintaining quality standards for front-end development",
        "children": [
          { "item": "Mentored junior developers and contractors" },
          {
            "item": "Conducted learning sessions, individual peer programming sessions"
          },
          { "item": "Reviewed team PRs" }
        ]
      },
      {
        "item": "Led feature initiatives for the development team as project &ldquo;anchor&rdquo;",
        "children": [
          { "item": "Served as team liaison with PMs" },
          { "item": "Negotiated technical requirements with PMs and design" },
          { "item": "Documented technical requirements" },
          { "item": "Developed project ship points" },
          { "item": "Shepherded development calendar" },
          { "item": "Led team scrum meetings" }
        ]
      },
      {
        "item": "Negotiated schema for REST data responses with back-end engineers."
      },
      {
        "item": "Led front-end engineering efforts on error handling and monitoring."
      },
      {
        "item": "Led front-end engineering efforts on i18n and l10n."
      },
      {
        "item": "Developed a hackathon project that was integrated into the production app: a custom React hook to manage query parameters which enabled flexible sharing of UI state for customer data visibility and greater efficiency during QA cycles."
      }
    ],
    "skills": [
      "typescript",
      "javascript",
      "react",
      "html",
      "css",
      "project-management",
      "devops"
    ]
  },
  {
    "name": "Northeastern University",
    "id": "neu",
    "url": "https://www.northeastern.edu/",
    "location": "Boston, MA (Seattle campus)",
    "mapsLink": null,
    "title": "Part-time Lecturer",
    "start": "2018-09-01",
    "end": "2021-05-01",
    "summary": "Northeastern University invited me to create and teach a weekly 3-hour lecture and practical applications course for grad-level students, focusing on the basics of front-end development: HTML, CSS, JavaScript, React, usability and accessibility best practices in web UI design and development.",
    "contributions": [
      {
        "item": "Prepared lectures, homework, and tests for a 10-week course."
      },
      { "item": "Delivered weekly 3-hour lectures." },
      {
        "item": "Managed Github repositories and organizations for class lecture notes and group assignments."
      },
      { "item": "Facilitated class discussions via Canvas learning platform." },
      {
        "item": "Conducted weekly office hours to provide guidance and mentorship to students."
      },
      {
        "item": "Supervised a TA in grading and providing feedback on weekly homework and tests."
      },
      { "item": "Managed class administration via Canvas learning platform." }
    ],
    "skills": [
      "javascript",
      "react",
      "html",
      "css",
      "project-management",
      "devops",
      "teaching",
      "uxui-design"
    ]
  },
  {
    "name": "The Climate Corporation",
    "id": "climate",
    "url": "http://www.climate.com",
    "location": "Seattle, WA",
    "mapsLink": null,
    "title": "Staff software developer",
    "start": "2014-09-01",
    "end": "2019-01-01",
    "summary": "As a staff engineer for The Climate Corporation’s Insights web team, I supported the desktop and webview UI. I also led the initiative to build the next iteration of our internal React component asset library.",
    "contributions": [
      {
        "item": "Led front-end development of React app to integrate digital farming diagnostic equipment with farm field mapping and CRUD operations."
      },
      {
        "item": "Collaborated closely with design teams in California and Missouri to test and validate use cases."
      },
      {
        "item": "Led project to refactor and improve internal React library for use by internal front-end development team with an eye towards extensibility and accessibility."
      },
      {
        "item": "Maintained quality standards for front-end development:",
        "children": [
          { "item": "Mentored junior developers" },
          {
            "item": "Conducted technical presentations and brown bag sessions"
          },
          { "item": "Reviewed team PRs" }
        ]
      }
    ],
    "skills": [
      "javascript",
      "react",
      "html",
      "css",
      "project-management",
      "devops"
    ]
  },
  {
    "name": "Wetpaint",
    "id": "wetpaint",
    "url": "https://en.wikipedia.org/wiki/Wetpaint",
    "location": "Seattle, WA",
    "mapsLink": null,
    "title": "Front-end software developer",
    "start": "2012-10-01",
    "end": "2014-09-01",
    "summary": "I was hired by Wetpaint to supplement its growing development team supporting dynamic entertainment content for women aged 18-34.",
    "contributions": [
      {
        "item": "Supported UI for the Wetpaint consumer experience website and associated products."
      },
      {
        "item": "Drove conversion to a responsive layout to serve both desktop and mobile users."
      },
      { "item": "Led implementation of site redesign." }
    ],
    "skills": [
      "javascript",
      "html",
      "css",
      "project-management",
      "ruby",
      "rails"
    ]
  },
  {
    "name": "Aptimus (Apollo Education Group)",
    "id": "uopx",
    "url": "https://www.linkedin.com/company/apollo-group/",
    "location": "Seattle, WA",
    "mapsLink": null,
    "title": "Front-end software developer",
    "start": "2009-02-01",
    "end": "2012-10-01",
    "summary": "I was hired By Aptimus as the cornerstone of a growing front-end development team tasked with supporting the University of Phoenix marketing website (http://www.phoenix.edu), a high-traffic site that receives millions of page views every month. As Led UI developer, I create dynamic, data-driven templates and components utilized by the Apollo Group web content strategy team to build the UOPX website.",
    "contributions": [
      {
        "item": "Led development of template UI for UOPX homepage, degree-program pages, course pages and continuing education mini-site (many of the site&rsquo;s highest-visibility pages), as well as various extensible components."
      },
      {
        "item": "Collaborated closely with UX design teams in Arizona to test and validate use cases."
      },
      {
        "item": "Spearheaded integration of Backbone MVC framework in codebase from research through implementation to standardize team Javascript coding efforts."
      },
      {
        "item": "Led key CSS refactoring efforts to reduce CSS load times and improve development efficiency."
      },
      {
        "item": "Mentored junior developers in Day (Adobe) CQ enterprise CMS development and JavaScript."
      },
      {
        "item": "Initiated project to support responsive presentation for mobile devices via implementation of Bootstrap."
      }
    ],
    "skills": ["javascript", "html", "css", "project-management"]
  },
  {
    "name": "Zillow.com",
    "id": "zillow",
    "url": "https://www.zillow.com/",
    "location": "Seattle, WA",
    "mapsLink": null,
    "title": "Front-end software developer",
    "start": "2008-05-01",
    "end": "2008-10-01",
    "summary": "I was recruited by Zillow.com to provide development expertise with regard to UI.",
    "contributions": [
      { "item": "Developed UI for Zillow Professional Directory." },
      {
        "item": "Presented talk advocating for semantic HTML development during Zillow Developer Presentation."
      },
      {
        "item": "Contributed core Web 2.0 concepts such as standards-based development; code validation; and separation of structure, presentation and behavior into Zillow codebase."
      }
    ],
    "skills": ["javascript", "html", "css"]
  },
  {
    "name": "Seismic Interactive & Design",
    "id": "seismic",
    "url": null,
    "location": "Green Bay, WI",
    "mapsLink": null,
    "title": "Web designer/developer",
    "start": "2003-05-01",
    "end": "2008-04-01",
    "summary": "I was hired to guide development of company into full-service interactive agency, implement processes for small- and large-scale web project development and provide advanced level of design/development expertise with regard to UI and programming. I implemented all phases of site development; mentored co-workers in web development skills; administrated Linux-based dedicated server and in-house Internet connectivity infrastructure on a day-to-day operational basis; and provided Internet technologies consulting for 20+ employees of strategic-management affiliate company.",
    "contributions": [
      {
        "item": "Created proprietary WAVE<sup>&trade;</sup> client needs evaluation, which was implemented as standard procedure in project exploratory process."
      },
      {
        "item": "Managed transfer of client websites to in-house dedicated server, allowing company to generate new revenue stream and significantly reduce third-party website hosting expenses."
      },
      {
        "item": "Headed technical development of ADDY award-winning projects",
        "children": [
          {
            "item": "Green Bay Chamber of Commerce &ldquo;Shine&rdquo; interactive CD (2003)"
          },
          {
            "item": "Green Bay Chamber of Commerce &ldquo;A Place To Shine&rdquo; website (2006)"
          }
        ]
      },
      {
        "item": "Integrated core Web 2.0 concepts such as standards-based development; code validation; and separation of structure, presentation and behavior into company web development process."
      }
    ],
    "skills": [
      "javascript",
      "html",
      "css",
      "project-management",
      "uxui-design",
      "devops"
    ]
  },
  {
    "name": "FutureLook, Inc.",
    "id": "futurelook",
    "url": null,
    "location": "Oshkosh, WI",
    "mapsLink": null,
    "title": "Web designer/developer",
    "start": "2002-09-01",
    "end": "2002-05-01",
    "summary": "I was contracted to provide seamless continuity of website development during a critical transitional period. During this time, I implemented all phases of site development.",
    "contributions": [
      {
        "item": "Implemented all phases of site design and development"
      }
    ],
    "skills": [
      "javascript",
      "html",
      "css",
      "project-management",
      "uxui-design",
      "devops"
    ]
  },
  {
    "name": "Pulse Communications",
    "id": "pulse",
    "url": null,
    "location": "Green Bay, WI",
    "mapsLink": null,
    "title": "Web designer/developer",
    "start": "1999-02-01",
    "end": "2001-04-01",
    "summary": "I was hired to guide development of company into full-service interactive agency, implement processes for small- and large-scale web project development and provide advanced level of design/development expertise with regard to UI and programming. I implemented all phases of site development; mentored co-workers in web development skills; administrated Linux-based dedicated server and in-house Internet connectivity infrastructure on a day-to-day operational basis; and provided Internet technologies consulting for 20+ employees of strategic-management affiliate company.",
    "contributions": [
      {
        "item": "Implemented all phases of site design and development."
      },
      { "item": "Mentored colleagues in front-end development." },

      {
        "item": "Developed interactive trade show kiosk, increasing client&rsquo;s product sales by 625%. (25 systems vs. 4 systems in previous year)."
      },
      {
        "item": "Proposed, built and deployed company intranet to improve internal communication and project coordination."
      }
    ],
    "skills": [
      "javascript",
      "html",
      "css",
      "project-management",
      "uxui-design",
      "devops"
    ]
  }
]
